In [1]:
import numpy as np
import pandas as pd
from numpy.random import rand

In [7]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])

d = {'a':10,'b':20,'c':30}

In [8]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [13]:
ser1 = pd.Series([1,2,3,4], index= ['USA','Germany','China','Japan'])

In [14]:
ser1

USA        1
Germany    2
China      3
Japan      4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,5,4],index=['USA','Germany','France','India'])

In [16]:
ser2

USA        1
Germany    3
France     5
India      7
dtype: int64

In [19]:
np.random.seed(11)

In [21]:
df = pd.DataFrame(np.random.randint(1,20,(5,4)),index='A B C D E'.split())

In [22]:
df

    0   1   2   3
A  17  18  14  13
B   2   8  19  14
C  17   1  14  13
D   5   3  13   2
E  11   6   8  18

In [23]:
df[2]

A    14
B    19
C    14
D    13
E     8
Name: 2, dtype: int64

In [24]:
df[[0,2]]

    0   2
A  17  14
B   2  19
C  17  14
D   5  13
E  11   8

In [25]:
df['new'] =df[0]+df[1]

In [26]:
df

    0   1   2   3  new
A  17  18  14  13   35
B   2   8  19  14   10
C  17   1  14  13   18
D   5   3  13   2    8
E  11   6   8  18   17

In [27]:
df[4] = df[0]+df[1]

In [28]:
df

    0   1   2   3  new   4
A  17  18  14  13   35  35
B   2   8  19  14   10  10
C  17   1  14  13   18  18
D   5   3  13   2    8   8
E  11   6   8  18   17  17

In [30]:
df.drop('new',axis = 1)

    0   1   2   3   4
A  17  18  14  13  35
B   2   8  19  14  10
C  17   1  14  13  18
D   5   3  13   2   8
E  11   6   8  18  17

In [31]:
df

    0   1   2   3  new   4
A  17  18  14  13   35  35
B   2   8  19  14   10  10
C  17   1  14  13   18  18
D   5   3  13   2    8   8
E  11   6   8  18   17  17

In [36]:
df

    0   1   2   3   4
A  17  18  14  13  35
B   2   8  19  14  10
C  17   1  14  13  18
D   5   3  13   2   8
E  11   6   8  18  17

In [38]:
df.drop('B',axis=0)

    0   1   2   3   4
A  17  18  14  13  35
C  17   1  14  13  18
D   5   3  13   2   8
E  11   6   8  18  17

In [39]:
df

    0   1   2   3   4
A  17  18  14  13  35
B   2   8  19  14  10
C  17   1  14  13  18
D   5   3  13   2   8
E  11   6   8  18  17

In [41]:
df.drop('B',axis=0,inplace=True)

In [42]:
df

    0   1   2   3   4
A  17  18  14  13  35
C  17   1  14  13  18
D   5   3  13   2   8
E  11   6   8  18  17

In [44]:
df.loc['D']

0     5
1     3
2    13
3     2
4     8
Name: D, dtype: int64

In [45]:
df>10

       0      1      2      3      4
A   True   True   True   True   True
C   True  False   True   True   True
D  False  False   True  False  False
E   True  False  False   True   True

In [47]:
df[df>10]

      0     1     2     3     4
A  17.0  18.0  14.0  13.0  35.0
C  17.0   NaN  14.0  13.0  18.0
D   NaN   NaN  13.0   NaN   NaN
E  11.0   NaN   NaN  18.0  17.0

In [48]:
df['states']= [1,2,3,4]
df

    0   1   2   3   4  states
A  17  18  14  13  35       1
C  17   1  14  13  18       2
D   5   3  13   2   8       3
E  11   6   8  18  17       4

In [49]:
df.set_index('states')

         0   1   2   3   4
states
1       17  18  14  13  35
2       17   1  14  13  18
3        5   3  13   2   8
4       11   6   8  18  17

In [50]:
df

    0   1   2   3   4  states
A  17  18  14  13  35       1
C  17   1  14  13  18       2
D   5   3  13   2   8       3
E  11   6   8  18  17       4